; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	satellite3 - satellite
	instrument4 - instrument
	satellite4 - satellite
	instrument5 - instrument
	image0 - mode
	infrared1 - mode
	GroundStation0 - direction
	GroundStation2 - direction
	Star1 - direction
	Star4 - direction
	Star3 - direction
	Phenomenon5 - direction
	Planet6 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Star9 - direction
	Phenomenon10 - direction
	Phenomenon11 - direction
	Star12 - direction
	Phenomenon13 - direction
	Planet14 - direction
)
(:init
	(supports instrument0 image0)
	(supports instrument0 infrared1)
	(calibration_target instrument0 GroundStation2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon11)
	(supports instrument1 infrared1)
	(supports instrument1 image0)
	(calibration_target instrument1 Star1)
	(supports instrument2 infrared1)
	(calibration_target instrument2 GroundStation2)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon7)
	(supports instrument3 image0)
	(calibration_target instrument3 Star1)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet8)
	(supports instrument4 infrared1)
	(supports instrument4 image0)
	(calibration_target instrument4 Star4)
	(on_board instrument4 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet6)
	(supports instrument5 image0)
	(supports instrument5 infrared1)
	(calibration_target instrument5 Star3)
	(on_board instrument5 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Phenomenon11)
)
(:goal (and
	(pointing satellite2 Star1)
	(pointing satellite3 Phenomenon7)
	(pointing satellite4 Star9)
	(have_image Phenomenon5 image0)
	(have_image Planet6 image0)
	(have_image Phenomenon7 image0)
	(have_image Planet8 image0)
	(have_image Star9 infrared1)
	(have_image Phenomenon10 image0)
	(have_image Phenomenon11 infrared1)
	(have_image Star12 image0)
	(have_image Phenomenon13 infrared1)
	(have_image Planet14 image0)
))

)

; plan
1. (turn_to satellite4 star9 phenomenon11)
   deleted: (pointing satellite4 phenomenon11)
   added: (pointing satellite4 star9)
   goals met: 1 of 13
2. (turn_to satellite3 star4 planet6)
   deleted: (pointing satellite3 planet6)
   added: (pointing satellite3 star4)
   goals met: 1 of 13
3. (switch_on instrument4 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument4)
   goals met: 1 of 13
4. (calibrate satellite3 instrument4 star4)
   added: (calibrated instrument4)
   goals met: 1 of 13
5. (turn_to satellite3 planet14 star4)
   deleted: (pointing satellite3 star4)
   added: (pointing satellite3 planet14)
   goals met: 1 of 13
6. (take_image satellite3 planet14 instrument4 image0)
   added: (have_image planet14 image0)
   goals met: 2 of 13
7. (turn_to satellite3 phenomenon5 planet14)
   deleted: (pointing satellite3 planet14)
   added: (pointing satellite3 phenomenon5)
   goals met: 2 of 13
8. (take_image satellite3 phenomenon5 instrument4 image0)
   added: (have_image phenomenon5 image0)
   goals met: 3 of 13
9. (turn_to satellite3 phenomenon13 phenomenon5)
   deleted: (pointing satellite3 phenomenon5)
   added: (pointing satellite3 phenomenon13)
   goals met: 3 of 13
10. (take_image satellite3 phenomenon13 instrument4 infrared1)
   added: (have_image phenomenon13 infrared1)
   goals met: 4 of 13
11. (turn_to satellite3 phenomenon11 phenomenon13)
   deleted: (pointing satellite3 phenomenon13)
   added: (pointing satellite3 phenomenon11)
   goals met: 4 of 13
12. (take_image satellite3 phenomenon11 instrument4 infrared1)
   added: (have_image phenomenon11 infrared1)
   goals met: 5 of 13
13. (turn_to satellite3 phenomenon10 phenomenon11)
   deleted: (pointing satellite3 phenomenon11)
   added: (pointing satellite3 phenomenon10)
   goals met: 5 of 13
14. (turn_to satellite2 star1 planet8)
   deleted: (pointing satellite2 planet8)
   added: (pointing satellite2 star1)
   goals met: 6 of 13
15. (take_image satellite3 phenomenon10 instrument4 image0)
   added: (have_image phenomenon10 image0)
   goals met: 7 of 13
16. (turn_to satellite3 planet6 phenomenon10)
   deleted: (pointing satellite3 phenomenon10)
   added: (pointing satellite3 planet6)
   goals met: 7 of 13
17. (take_image satellite3 planet6 instrument4 image0)
   added: (have_image planet6 image0)
   goals met: 8 of 13
18. (turn_to satellite3 planet8 planet6)
   deleted: (pointing satellite3 planet6)
   added: (pointing satellite3 planet8)
   goals met: 8 of 13
19. (take_image satellite3 planet8 instrument4 image0)
   added: (have_image planet8 image0)
   goals met: 9 of 13
20. (turn_to satellite3 star12 planet8)
   deleted: (pointing satellite3 planet8)
   added: (pointing satellite3 star12)
   goals met: 9 of 13
21. (take_image satellite3 star12 instrument4 image0)
   added: (have_image star12 image0)
   goals met: 10 of 13
22. (turn_to satellite3 star9 star12)
   deleted: (pointing satellite3 star12)
   added: (pointing satellite3 star9)
   goals met: 10 of 13
23. (take_image satellite3 star9 instrument4 infrared1)
   added: (have_image star9 infrared1)
   goals met: 11 of 13
24. (turn_to satellite3 phenomenon7 star9)
   deleted: (pointing satellite3 star9)
   added: (pointing satellite3 phenomenon7)
   goals met: 12 of 13
25. (take_image satellite3 phenomenon7 instrument4 image0)
   added: (have_image phenomenon7 image0)
   goals met: 13 of 13
